# Capstone Two: EDA

In [1]:
import os
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt 
import seaborn as sns

#suppress future warnings
import warnings
warnings.simplefilter(action='ignore', category=FutureWarning)
warnings.simplefilter(action='ignore', category=UserWarning)

# Show plots inline
%matplotlib inline

In [2]:
#import sys
#!{sys.executable} -m pip install stem

In [8]:
path1 = os.getcwd()

In [20]:
path2 = path1[:-10]

In [21]:
path2

'/home/kc3pve/Desktop/Spring-Git/Springboard/Credit'

In [22]:
path3 = path2 +'/' +'data'

In [23]:
path3

'/home/kc3pve/Desktop/Spring-Git/Springboard/Credit/data'

In [30]:
X_df1 = path3 + '/' +'X_df.csv'
Y_df1 = path3 + '/' +'Y_df.csv'

In [32]:
X_df2 = pd.read_csv(X_df1)
Y_df2 = pd.read_csv(Y_df1)

In [29]:
X_df2

,Unnamed: 0,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,CNT_FAM_MEMBERS
0,0,1,0,1,1,126000.000000,4,4,0,1,-12301,-140,3.0
1,1,1,0,1,2,337500.000000,0,4,1,1,-9732,-134,4.0
2,2,0,0,1,1,90000.000000,4,1,1,1,-13546,-3373,3.0
3,3,1,1,1,1,157500.000000,4,4,1,1,-17991,-3304,3.0
4,4,1,1,0,1,315000.000000,0,1,1,5,-11689,-716,3.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16737,4983,1,0,0,1,335439.925489,0,1,1,1,-16632,-2493,3.0
16738,4984,0,0,1,1,202500.000000,0,4,1,1,-14653,-314,3.0
16739,4985,1,1,0,1,180000.000000,4,4,1,1,-15391,-958,3.0
16740,4986,1,1,1,2,211500.000000,4,4,1,1,-10435,-2987,4.0
16741,4987,0,0,1,1,76500.000000,1,4,1,1,-20442,365243,3.0

In [33]:
Y_df2

       Unnamed: 0  STATUS
0               0       0
1               1       0
2               2       0
3               3       0
4               4       0
...           ...     ...
16737        4983       1
16738        4984       1
16739        4985       1
16740        4986       1
16741        4987       1

[16742 rows x 2 columns]

In [34]:
Y_df2.head()

   Unnamed: 0  STATUS
0           0       0
1           1       0
2           2       0
3           3       0
4           4       0